; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck package - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - package ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action load-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action unload-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action board-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action disembark-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action drive-truck
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location
    ?truck - truck)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action walk
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-4-5-16)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	package1 - package
	package2 - package
	package3 - package
	package4 - package
	package5 - package
	package6 - package
	package7 - package
	package8 - package
	package9 - package
	package10 - package
	package11 - package
	package12 - package
	package13 - package
	package14 - package
	package15 - package
	package16 - package
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	p0-2 - location
	p0-4 - location
	p0-5 - location
	p1-2 - location
	p1-4 - location
	p1-6 - location
	p3-1 - location
	p3-6 - location
	p3-7 - location
	p4-3 - location
	p4-8 - location
	p7-1 - location
	p7-2 - location
	p8-0 - location
	p8-2 - location
	p8-3 - location
	p8-5 - location
	)
	(:init
	(at driver1 s2)
	(at driver2 s3)
	(at driver3 s6)
	(at driver4 s2)
	(at truck1 s6)
	(empty truck1)
	(at truck2 s5)
	(empty truck2)
	(at truck3 s7)
	(empty truck3)
	(at truck4 s8)
	(empty truck4)
	(at truck5 s3)
	(empty truck5)
	(at package1 s8)
	(at package2 s1)
	(at package3 s7)
	(at package4 s7)
	(at package5 s4)
	(at package6 s3)
	(at package7 s5)
	(at package8 s6)
	(at package9 s0)
	(at package10 s0)
	(at package11 s5)
	(at package12 s4)
	(at package13 s6)
	(at package14 s1)
	(at package15 s7)
	(at package16 s3)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(path s0 p0-4)
	(path p0-4 s0)
	(path s4 p0-4)
	(path p0-4 s4)
	(path s0 p0-5)
	(path p0-5 s0)
	(path s5 p0-5)
	(path p0-5 s5)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(path s1 p1-4)
	(path p1-4 s1)
	(path s4 p1-4)
	(path p1-4 s4)
	(path s1 p1-6)
	(path p1-6 s1)
	(path s6 p1-6)
	(path p1-6 s6)
	(path s3 p3-1)
	(path p3-1 s3)
	(path s1 p3-1)
	(path p3-1 s1)
	(path s3 p3-6)
	(path p3-6 s3)
	(path s6 p3-6)
	(path p3-6 s6)
	(path s3 p3-7)
	(path p3-7 s3)
	(path s7 p3-7)
	(path p3-7 s7)
	(path s4 p4-3)
	(path p4-3 s4)
	(path s3 p4-3)
	(path p4-3 s3)
	(path s4 p4-8)
	(path p4-8 s4)
	(path s8 p4-8)
	(path p4-8 s8)
	(path s7 p7-1)
	(path p7-1 s7)
	(path s1 p7-1)
	(path p7-1 s1)
	(path s7 p7-2)
	(path p7-2 s7)
	(path s2 p7-2)
	(path p7-2 s2)
	(path s8 p8-0)
	(path p8-0 s8)
	(path s0 p8-0)
	(path p8-0 s0)
	(path s8 p8-2)
	(path p8-2 s8)
	(path s2 p8-2)
	(path p8-2 s2)
	(path s8 p8-3)
	(path p8-3 s8)
	(path s3 p8-3)
	(path p8-3 s3)
	(path s8 p8-5)
	(path p8-5 s8)
	(path s5 p8-5)
	(path p8-5 s5)
	(link s0 s2)
	(link s2 s0)
	(link s1 s3)
	(link s3 s1)
	(link s1 s5)
	(link s5 s1)
	(link s1 s8)
	(link s8 s1)
	(link s2 s1)
	(link s1 s2)
	(link s2 s3)
	(link s3 s2)
	(link s2 s4)
	(link s4 s2)
	(link s2 s6)
	(link s6 s2)
	(link s2 s7)
	(link s7 s2)
	(link s3 s0)
	(link s0 s3)
	(link s3 s4)
	(link s4 s3)
	(link s4 s5)
	(link s5 s4)
	(link s5 s3)
	(link s3 s5)
	(link s5 s6)
	(link s6 s5)
	(link s5 s7)
	(link s7 s5)
	(link s6 s3)
	(link s3 s6)
	(link s7 s0)
	(link s0 s7)
	(link s7 s4)
	(link s4 s7)
	(link s7 s6)
	(link s6 s7)
	(link s8 s5)
	(link s5 s8)
	(link s8 s7)
	(link s7 s8)
)
	(:goal (and
	(at driver1 s2)
	(at driver3 s2)
	(at driver4 s7)
	(at truck3 s7)
	(at truck4 s1)
	(at truck5 s7)
	(at package1 s2)
	(at package2 s4)
	(at package3 s8)
	(at package4 s5)
	(at package5 s7)
	(at package6 s5)
	(at package7 s1)
	(at package9 s8)
	(at package11 s2)
	(at package12 s3)
	(at package13 s2)
	(at package14 s0)
	(at package15 s5)
	(at package16 s0)
	))


)

; plan
1. (board-truck driver2 s3 truck5)
   deleted: (at driver2 s3) (empty truck5)
   added: (driving driver2 truck5)
   goals met: 2 of 20
2. (drive-truck driver2 s3 s4 truck5)
   deleted: (at truck5 s3)
   added: (at truck5 s4)
   goals met: 2 of 20
3. (drive-truck driver2 s4 s5 truck5)
   deleted: (at truck5 s4)
   added: (at truck5 s5)
   goals met: 2 of 20
4. (board-truck driver3 s6 truck1)
   deleted: (at driver3 s6) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 2 of 20
5. (drive-truck driver2 s5 s7 truck5)
   deleted: (at truck5 s5)
   added: (at truck5 s7)
   goals met: 3 of 20
6. (drive-truck driver3 s6 s2 truck1)
   deleted: (at truck1 s6)
   added: (at truck1 s2)
   goals met: 3 of 20
7. (drive-truck driver3 s2 s1 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s1)
   goals met: 3 of 20
8. (load-truck s1 package2 truck1)
   deleted: (at package2 s1)
   added: (in package2 truck1)
   goals met: 3 of 20
9. (drive-truck driver3 s1 s2 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s2)
   goals met: 3 of 20
10. (drive-truck driver3 s2 s3 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s3)
   goals met: 3 of 20
11. (load-truck s3 package6 truck1)
   deleted: (at package6 s3)
   added: (in package6 truck1)
   goals met: 3 of 20
12. (drive-truck driver3 s3 s4 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s4)
   goals met: 3 of 20
13. (load-truck s4 package5 truck1)
   deleted: (at package5 s4)
   added: (in package5 truck1)
   goals met: 3 of 20
14. (drive-truck driver3 s4 s5 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s5)
   goals met: 3 of 20
15. (load-truck s5 package7 truck1)
   deleted: (at package7 s5)
   added: (in package7 truck1)
   goals met: 3 of 20
16. (unload-truck s5 package6 truck1)
   deleted: (in package6 truck1)
   added: (at package6 s5)
   goals met: 4 of 20
17. (load-truck s5 package11 truck1)
   deleted: (at package11 s5)
   added: (in package11 truck1)
   goals met: 4 of 20
18. (drive-truck driver3 s5 s1 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s1)
   goals met: 4 of 20
19. (drive-truck driver3 s1 s2 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s2)
   goals met: 4 of 20
20. (unload-truck s2 package11 truck1)
   deleted: (in package11 truck1)
   added: (at package11 s2)
   goals met: 5 of 20
21. (load-truck s7 package4 truck5)
   deleted: (at package4 s7)
   added: (in package4 truck5)
   goals met: 5 of 20
22. (load-truck s7 package3 truck5)
   deleted: (at package3 s7)
   added: (in package3 truck5)
   goals met: 5 of 20
23. (drive-truck driver2 s7 s8 truck5)
   deleted: (at truck5 s7)
   added: (at truck5 s8)
   goals met: 4 of 20
24. (unload-truck s8 package3 truck5)
   deleted: (in package3 truck5)
   added: (at package3 s8)
   goals met: 5 of 20
25. (load-truck s8 package1 truck5)
   deleted: (at package1 s8)
   added: (in package1 truck5)
   goals met: 5 of 20
26. (drive-truck driver2 s8 s7 truck5)
   deleted: (at truck5 s8)
   added: (at truck5 s7)
   goals met: 6 of 20
27. (load-truck s7 package15 truck5)
   deleted: (at package15 s7)
   added: (in package15 truck5)
   goals met: 6 of 20
28. (walk driver4 s2 p7-2)
   deleted: (at driver4 s2)
   added: (at driver4 p7-2)
   goals met: 6 of 20
29. (walk driver4 p7-2 s7)
   deleted: (at driver4 p7-2)
   added: (at driver4 s7)
   goals met: 7 of 20
30. (drive-truck driver2 s7 s5 truck5)
   deleted: (at truck5 s7)
   added: (at truck5 s5)
   goals met: 6 of 20
31. (unload-truck s5 package4 truck5)
   deleted: (in package4 truck5)
   added: (at package4 s5)
   goals met: 7 of 20
32. (drive-truck driver2 s5 s4 truck5)
   deleted: (at truck5 s5)
   added: (at truck5 s4)
   goals met: 7 of 20
33. (load-truck s4 package12 truck5)
   deleted: (at package12 s4)
   added: (in package12 truck5)
   goals met: 7 of 20
34. (drive-truck driver2 s4 s3 truck5)
   deleted: (at truck5 s4)
   added: (at truck5 s3)
   goals met: 7 of 20
35. (load-truck s3 package16 truck5)
   deleted: (at package16 s3)
   added: (in package16 truck5)
   goals met: 7 of 20
36. (drive-truck driver2 s3 s0 truck5)
   deleted: (at truck5 s3)
   added: (at truck5 s0)
   goals met: 7 of 20
37. (load-truck s0 package9 truck5)
   deleted: (at package9 s0)
   added: (in package9 truck5)
   goals met: 7 of 20
38. (drive-truck driver2 s0 s7 truck5)
   deleted: (at truck5 s0)
   added: (at truck5 s7)
   goals met: 8 of 20
39. (walk driver1 s2 p8-2)
   deleted: (at driver1 s2)
   added: (at driver1 p8-2)
   goals met: 7 of 20
40. (walk driver1 p8-2 s8)
   deleted: (at driver1 p8-2)
   added: (at driver1 s8)
   goals met: 7 of 20
41. (board-truck driver1 s8 truck4)
   deleted: (at driver1 s8) (empty truck4)
   added: (driving driver1 truck4)
   goals met: 7 of 20
42. (drive-truck driver1 s8 s1 truck4)
   deleted: (at truck4 s8)
   added: (at truck4 s1)
   goals met: 8 of 20
43. (load-truck s1 package14 truck4)
   deleted: (at package14 s1)
   added: (in package14 truck4)
   goals met: 8 of 20
44. (drive-truck driver1 s1 s2 truck4)
   deleted: (at truck4 s1)
   added: (at truck4 s2)
   goals met: 7 of 20
45. (drive-truck driver2 s7 s0 truck5)
   deleted: (at truck5 s7)
   added: (at truck5 s0)
   goals met: 6 of 20
46. (unload-truck s0 package16 truck5)
   deleted: (in package16 truck5)
   added: (at package16 s0)
   goals met: 7 of 20
47. (drive-truck driver2 s0 s2 truck5)
   deleted: (at truck5 s0)
   added: (at truck5 s2)
   goals met: 7 of 20
48. (drive-truck driver2 s2 s7 truck5)
   deleted: (at truck5 s2)
   added: (at truck5 s7)
   goals met: 8 of 20
49. (drive-truck driver2 s7 s5 truck5)
   deleted: (at truck5 s7)
   added: (at truck5 s5)
   goals met: 7 of 20
50. (unload-truck s5 package15 truck5)
   deleted: (in package15 truck5)
   added: (at package15 s5)
   goals met: 8 of 20
51. (drive-truck driver2 s5 s7 truck5)
   deleted: (at truck5 s5)
   added: (at truck5 s7)
   goals met: 9 of 20
52. (drive-truck driver2 s7 s2 truck5)
   deleted: (at truck5 s7)
   added: (at truck5 s2)
   goals met: 8 of 20
53. (unload-truck s2 package1 truck5)
   deleted: (in package1 truck5)
   added: (at package1 s2)
   goals met: 9 of 20
54. (drive-truck driver2 s2 s7 truck5)
   deleted: (at truck5 s2)
   added: (at truck5 s7)
   goals met: 10 of 20
55. (drive-truck driver2 s7 s6 truck5)
   deleted: (at truck5 s7)
   added: (at truck5 s6)
   goals met: 9 of 20
56. (load-truck s6 package13 truck5)
   deleted: (at package13 s6)
   added: (in package13 truck5)
   goals met: 9 of 20
57. (drive-truck driver2 s6 s2 truck5)
   deleted: (at truck5 s6)
   added: (at truck5 s2)
   goals met: 9 of 20
58. (unload-truck s2 package13 truck5)
   deleted: (in package13 truck5)
   added: (at package13 s2)
   goals met: 10 of 20
59. (drive-truck driver2 s2 s7 truck5)
   deleted: (at truck5 s2)
   added: (at truck5 s7)
   goals met: 11 of 20
60. (drive-truck driver2 s7 s8 truck5)
   deleted: (at truck5 s7)
   added: (at truck5 s8)
   goals met: 10 of 20
61. (unload-truck s8 package9 truck5)
   deleted: (in package9 truck5)
   added: (at package9 s8)
   goals met: 11 of 20
62. (drive-truck driver2 s8 s5 truck5)
   deleted: (at truck5 s8)
   added: (at truck5 s5)
   goals met: 11 of 20
63. (drive-truck driver2 s5 s3 truck5)
   deleted: (at truck5 s5)
   added: (at truck5 s3)
   goals met: 11 of 20
64. (unload-truck s3 package12 truck5)
   deleted: (in package12 truck5)
   added: (at package12 s3)
   goals met: 12 of 20
65. (drive-truck driver2 s3 s6 truck5)
   deleted: (at truck5 s3)
   added: (at truck5 s6)
   goals met: 12 of 20
66. (drive-truck driver2 s6 s7 truck5)
   deleted: (at truck5 s6)
   added: (at truck5 s7)
   goals met: 13 of 20
67. (drive-truck driver3 s2 s4 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s4)
   goals met: 13 of 20
68. (unload-truck s4 package2 truck1)
   deleted: (in package2 truck1)
   added: (at package2 s4)
   goals met: 14 of 20
69. (drive-truck driver3 s4 s2 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s2)
   goals met: 14 of 20
70. (drive-truck driver3 s2 s1 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s1)
   goals met: 14 of 20
71. (unload-truck s1 package7 truck1)
   deleted: (in package7 truck1)
   added: (at package7 s1)
   goals met: 15 of 20
72. (drive-truck driver3 s1 s2 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s2)
   goals met: 15 of 20
73. (drive-truck driver3 s2 s7 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s7)
   goals met: 15 of 20
74. (unload-truck s7 package5 truck1)
   deleted: (in package5 truck1)
   added: (at package5 s7)
   goals met: 16 of 20
75. (drive-truck driver3 s7 s2 truck1)
   deleted: (at truck1 s7)
   added: (at truck1 s2)
   goals met: 16 of 20
76. (disembark-truck driver3 s2 truck1)
   deleted: (driving driver3 truck1)
   added: (at driver3 s2) (empty truck1)
   goals met: 17 of 20
77. (drive-truck driver1 s2 s0 truck4)
   deleted: (at truck4 s2)
   added: (at truck4 s0)
   goals met: 17 of 20
78. (unload-truck s0 package14 truck4)
   deleted: (in package14 truck4)
   added: (at package14 s0)
   goals met: 18 of 20
79. (drive-truck driver1 s0 s2 truck4)
   deleted: (at truck4 s0)
   added: (at truck4 s2)
   goals met: 18 of 20
80. (drive-truck driver1 s2 s1 truck4)
   deleted: (at truck4 s2)
   added: (at truck4 s1)
   goals met: 19 of 20
81. (disembark-truck driver1 s1 truck4)
   deleted: (driving driver1 truck4)
   added: (at driver1 s1) (empty truck4)
   goals met: 19 of 20
82. (walk driver1 s1 p1-2)
   deleted: (at driver1 s1)
   added: (at driver1 p1-2)
   goals met: 19 of 20
83. (walk driver1 p1-2 s2)
   deleted: (at driver1 p1-2)
   added: (at driver1 s2)
   goals met: 20 of 20
